IDENTIFICATION DIVISION.
PROGRAM-ID. FIZZ-BUZZ.
AUTHOR.     FATIMA-EZZAHRA CHAQRI.

ENVIRONMENT DIVISION. 
CONFIGURATION SECTION.

DATA DIVISION.
WORKING-STORAGE SECTION.

    01 WS-COUNTER                           PIC ZZZ.
    01 WS-COUNTER-CHAR REDEFINES WS-COUNTER PIC X(3).
    01 WS-COUNTER-CHAR-WITHOUT-SPACES       PIC X(3).
    01 WS-FIZZ-NUMBER                       PIC 9(3).
    01 WS-BUZZ-NUMBER                       PIC 9(3).
    01 WS-MOD-FIZZ-NUMBER                   PIC 9(3).
    01 WS-MOD-BUZZ-NUMBER                   PIC 9(3).
    01 WS-MOD-FIZZ-MLTPL-BUZZ               PIC 9(3).
    77 WS-CST-DSPL-FIZZBUZZ                 PIC X(8) VALUE 'FIZZBUZZ'.
    77 WS-CST-DSPL-FIZZ                     PIC X(8) VALUE 'FIZZ'.
    77 WS-CST-DSPL-BUZZ                     PIC X(8) VALUE 'BUZZ'.

PROCEDURE DIVISION.

    MOVE 0 TO WS-COUNTER.
    MOVE 3 TO WS-FIZZ-NUMBER.
    MOVE 5 TO WS-BUZZ-NUMBER.

MAIN SECTION.
   
    PERFORM VARYING WS-COUNTER FROM 1 BY 1 UNTIL WS-COUNTER = 100
        COMPUTE WS-MOD-FIZZ-NUMBER = FUNCTION MOD(WS-COUNTER WS-FIZZ-NUMBER)
        COMPUTE WS-MOD-BUZZ-NUMBER = FUNCTION MOD(WS-COUNTER WS-BUZZ-NUMBER)
        COMPUTE WS-MOD-FIZZ-MLTPL-BUZZ = FUNCTION MOD(WS-COUNTER WS-FIZZ-NUMBER*WS-BUZZ-NUMBER)
        
        IF WS-MOD-FIZZ-MLTPL-BUZZ = ZEROES
            DISPLAY WS-CST-DSPL-FIZZBUZZ
        ELSE IF WS-MOD-FIZZ-NUMBER = ZEROES
            DISPLAY WS-CST-DSPL-FIZZ
        ELSE IF WS-MOD-BUZZ-NUMBER = ZEROES
            DISPLAY WS-CST-DSPL-BUZZ
        ELSE 
            MOVE FUNCTION TRIM(WS-COUNTER-CHAR) TO WS-COUNTER-CHAR-WITHOUT-SPACES  
            DISPLAY WS-COUNTER-CHAR-WITHOUT-SPACES
        
        END-IF
        
    END-PERFORM.
    
MAIN-EXIT.
EXIT.
STOP RUN.